Repository: AbuBasssam/CarRentalSystem
Catalog: Application/Resources/SharedResources.*.resx
Languages: ar

source: Success
ar: نجح

source: Created
ar: تم الإنشاء

source: Deleted
ar: محذوف

source: Failed
ar: فشل

source: Bad Request
ar: طلب خاطئ

source: Unauthorized
ar: غير مخول

source: Not Found
ar: غير موجود

source: Unprocessable Entity
ar: كيان غير قابل للمعالجة

source: Internal Server Error
ar: خطأ داخلي بالسيرفر

source: Required
ar: مطلوب

source: Not Empty
ar: غير فارغ

# PropertyCannotBeNull
source: Required! {PropertyName} cannot be null
ar: مطلوب! {PropertyName} لا يمكن أن يكون فارغ

# PropertyCannotBeEmpty
source: Required! {PropertyName} cannot be empty
ar: مطلوب! {PropertyName} لا يمكن أن يكون فارغ

# NameNoSpacesAllowed
source: Name cannot contain spaces
ar: لا يمكن أن يحتوي الاسم على مسافات

# NameInvalidCharacters
source: Name can only contain letters and numbers
ar: يجب أن يحتوي الاسم على أحرف وأرقام فقط

# MinLength
source: {PropertyName} must be at least {0} characters
ar: {0} يجب أن يكون على الأقل {1} حرف

# MaxLength
source: {PropertyName} must be less than or equal to {0} characters
ar: {0} يجب أن يكون أقل من أو يساوي {1} حرف

# EmailRequired
source: Email is required field
ar: الإيميل حقل مطلوب

# PasswordRequired
source: Password is required field
ar: كلمة المرور حقل مطلوب

# TokenRequired
source: Session token is required
ar: الرمز حقل مطلوب

# CodeRequired
source: Code is required
ar: الرمز حقل مطلوب

# PhoneNumberRequired
source: Phone number is required field
ar: رقم الهاتف حقل مطلوب

# NameRequired
source: Name is required field
ar: الاسم حقل مطلوب

# GoogleIdTokenRequired
source: Google ID token is required for Google Sign-In
ar: رمز جوجل مطلوب لتسجيل الدخول بجوجل

# RequestPayloadRequired
source: Request payload is required
ar: بيانات الطلب مطلوبة

# InvalidEmail
source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صالح

# InvalidCode
source: Invalid code format
ar: تنسيق الرمز خاطئ

# InvalidPhoneNumber
source: Phone number must be in format: +966 5X XXX XXXX
ar: رقم الهاتف يجب أن يكون بالصيغة: +966 5X XXX XXXX

# NameLengthRange
source: Name should be between 8 and 16 characters
ar: يجب أن يكون الاسم بين 8 و 16 حرفاً

# InValidCredentials
source: Invalid email and/or password
ar: البريد الإلكتروني أو كلمة المرور غير صالحة

source: Invalid access token
ar: رمز الوصول غير صحيح

source: Invalid Google token
ar: رمز جوجل غير صالح

# ErrorConfirmingResetPasswordCode
source: An error occurred while confirming the reset password code
ar: حدث خطأ أثناء تأكيد رقم الهاتف

# ErrorResettingPassword
source: Error resetting password for token: {0}
ar: خطأ في إعادة تعيين كلمة المرور للرمز: {0}

# TwoFactorRequired
source: Two-factor authentication is required to sign in
ar: مطلوب المصادقة الثنائية لتسجيل الدخول

source: Email already exists
ar: الإيميل موجود بالفعل

source: User not found
ar: المستخدم غير موجود

# UserCreationFailed
source: Failed to create user
ar: فشل في إنشاء المستخدم

# EmailConfirmationFailed
source: An error occurred while confirming the email
ar: حدث خطأ أثناء تأكيد الإيميل

# AccountLockedOut
source: Your account has been locked due to multiple failed login attempts. Please try again in {0} minutes
ar: تم قفل حسابك بسبب محاولات تسجيل دخول فاشلة متعددة. يرجى المحاولة مرة أخرى خلال {0} دقيقة

source: Claims principle is null
ar: مبدأ المطالبات فارغ

source: Invalid user ID
ar: معرف المستخدم غير صحيح

source: Invalid email claim
ar: مطالبة البريد الإلكتروني غير صحيحة

source: Invalid phone number claim
ar: مطالبة رقم الهاتف غير صحيحة

# NullRefreshToken
source: Refresh token entity is null
ar: كيان الرمز المميز للتحديث فارغ

source: Revoked refresh token
ar: تم إلغاء الرمز المميز للتحديث

# FailedExtractToken
source: Failed to extract JWT token
ar: فشل في استخراج الرمز

# FailedExtractEmail
source: Failed to extract email from token
ar: فشل في استخراج البريد الإلكتروني من الرمز

# FailedExtractPhoneNumber
source: Failed to extract phone number from token
ar: فشل في استخراج رقم الهاتف من الرمز

# FailedToExtractCustomerId
source: Failed to extract customer ID from token
ar: فشل في استخراج معرف العميل من الرمز

# WaitCooldownPeriod
source: Please wait for 2 minutes before requesting a new confirmation code
ar: يرجى الانتظار دقيقتين قبل طلب رمز تأكيد جديد

# CooldownPeriodActive
source: Please wait until the cooldown period expires before requesting a new code
ar: يرجى الانتظار حتى انتهاء فترة الانتظار قبل طلب رمز جديد

source: Invalid/Expired Code
ar: رمز غير صحيح/منتهي الصلاحية

# ResendCooldown
source: Please wait {0} seconds before requesting a new code
ar: يرجى الانتظار {0} ثانية قبل طلب رمز جديد

# MinimumOrderAmount
source: Minimum order amount is
ar: الحد الأدنى لمبلغ الطلب هو

# InsufficientStock
source: Insufficient stock for item {0}
ar: مخزون غير كافي للصنف {0}

# FailedToUpdateInventory
source: Failed to update inventory for item {0}
ar: فشل في تحديث المخزون للصنف {0}

# RecentRefundError
source: You cannot place a new order due to a recent refund. Please contact support
ar: لا يمكنك تقديم طلب جديد بسبب استرداد حديث. يرجى الاتصال بالدعم

# EmailNotVerified
source: Please verify your email address before signing in. Check your inbox
ar: يرجى التحقق من عنوان بريدك الإلكتروني قبل تسجيل الدخول. تحقق من صندوق الوارد الخاص بك

# EmailAlreadyVerified
source: Email address is already verified
ar: تم التحقق من عنوان البريد الإلكتروني بالفعل

# VerificationCodeResent
source: A new verification code has been sent to your email
ar: تم إرسال رمز تحقق جديد إلى بريدك الإلكتروني

# PendingVerification
source: A registration exists for this email. Please verify your email or wait {0} hours to register again
ar: يوجد تسجيل لهذا البريد الإلكتروني. يرجى التحقق من بريدك الإلكتروني أو الانتظار {0} ساعة للتسجيل مرة أخرى

# InvalidToken
source: Invalid verification token
ar: رمز التحقق غير صالح

# TokenNotFound
source: Token not found or already expired
ar: الرمز غير موجود أو منتهي الصلاحية

# TokenExpired
source: Verification token has expired
ar: انتهت صلاحية رمز التحقق

# TokenRevoked
source: Verification token has been revoked
ar: تم إلغاء رمز التحقق

# LogoutSuccessful
source: You have been logged out successfully
ar: تم تسجيل الخروج بنجاح

# LogoutFailed
source: An error occurred during logout. Please try again
ar: حدث خطأ أثناء تسجيل الخروج. يرجى المحاولة مرة أخرى

# SuspiciousActivity
source: Suspicious activity detected
ar: تم اكتشاف نشاط مشبوه

# AccountLocked
source: Account is locked
ar: تم قفل الحساب

source: Invalid refresh token
ar: رمز التحديث غير صالح

# Currency
source: SAR
ar: ريال سعودي

source: Unexpected error
ar: خطأ غير متوقع

# ErrorOccurred
source: An error occurred
ar: حدث خطأ
